In [1]:
import sys, os
import numpy as np
import pandas as pd
import pandas.io.sql as psql
import sqlalchemy as sql
import sqlite3 as sqlite3

def header(msg):
    print('-'*50 + "\n" + msg +"\n")

filename='GSL_Ops.xlsx'   
conn = sqlite3.connect('customer.db')
cur=conn.cursor()

In [2]:
#header('What’s the revenue of the 90th percentile rank customer_id from CustomerRevenue, ordered by revenue (where the highest-revenue customer_id is in the 99th percentile)?')
sql_problem_1 = ("SELECT '90th Percentile' as Percentile_Rank, min(revenue) as revenue "
                 "FROM (Select CR.customer_id,printf('%.3f',CR.revenue) as revenue, PERCENT_RANK() Over(Order By CR.revenue asc) as rank "
                 "From CustomerRevenue as CR "
                 "Order by CR.revenue asc) "
                 "WHERE rank >=.9 "
                 "Group by 1;").format(1, 2)

print(sql_problem_1)
pd.read_sql_query(sql_problem_1,conn)

SELECT '90th Percentile' as Percentile_Rank, min(revenue) as revenue FROM (Select CR.customer_id,printf('%.3f',CR.revenue) as revenue, PERCENT_RANK() Over(Order By CR.revenue asc) as rank From CustomerRevenue as CR Order by CR.revenue asc) WHERE rank >=.9 Group by 1;

   Percentile_Rank   revenue
0  90th Percentile  6426.570

In [8]:
#header('What is the revenue by sales team region, along with revenue from accounts that have no sales team (note: Some customer IDs are assigned to a sales team in CustomerSalesTeam. Use this relationship to find your answer)?')
sql_problem_2 = ("Select coalesce(CST.region,'No Sales Team') as Sales_Team_region, sum(printf('%.3f',CR.revenue)) as revenue "
                 "From CustomerRevenue as CR "
                 "Left Join CustomerSalesTeam CST on CR.customer_id = CST.customer_id "
                 "Group by 1;").format(1, 2)

print(sql_problem_2)
pd.read_sql_query(sql_problem_2,conn)

Select coalesce(CST.region,'No Sales Team') as Sales_Team_region, sum(printf('%.3f',CR.revenue)) as revenue From CustomerRevenue as CR Left Join CustomerSalesTeam CST on CR.customer_id = CST.customer_id Group by 1;

  Sales_Team_region      revenue
0              APAC    46220.662
1          Americas    68450.476
2              EMEA    89071.016
3     No Sales Team  1976839.176

In [3]:
header('What is the revenue per agency (note: Some customer IDs have an agency assigned, in addition to their CustomerSalesTeam. A customer ID has an agency sales team if it both (1) appears in CustomerAgency and (2) the customer ID’s country in CustomerAgency matches the customer ID’s country in CustomerSalesTeam)?')
sql_problem_3 = ("Select CA.agency_name , sum(printf('%.3f',CR.revenue)) as revenue "
                     "FROM CustomerAgency CA "
                     "INNER JOIN CustomerSalesTeam CST on CA.customer_id = CST.customer_id and CA.country=CST.country "
                "LEFT JOIN CustomerRevenue CR on CA.customer_id = CR.customer_id "
                     "GROUP BY 1;").format(1,2)
print(sql_problem_3)
pd.read_sql_query(sql_problem_3,conn)

--------------------------------------------------
What is the revenue per agency (note: Some customer IDs have an agency assigned, in addition to their CustomerSalesTeam. A customer ID has an agency sales team if it both (1) appears in CustomerAgency and (2) the customer ID’s country in CustomerAgency matches the customer ID’s country in CustomerSalesTeam)?

Select CA.agency_name , sum(printf('%.3f',CR.revenue)) as revenue FROM CustomerAgency CA INNER JOIN CustomerSalesTeam CST on CA.customer_id = CST.customer_id and CA.country=CST.country LEFT JOIN CustomerRevenue CR on CA.customer_id = CR.customer_id GROUP BY 1;

    agency_name    revenue
0        Dentsu  26404.907
1  Independents  29202.143
2       Omnicom  13360.477
3      Publicis  10570.326
4           WPP  22722.817

In [4]:
header("Google is always running experiments to try to optimize our products. The CustomerExperiments table indicates which customer IDs are in the ALPHA experiment and which are in the BRAVO experiment. (Some customer IDs are enrolled in both.)"
       "\n When comparing total revenue from customer IDs in the ALPHA experiment to total revenue from customer IDs not in the experiment, which cohort has higher revenue?"
       "\n Is revenue from customers enrolled in the ALPHA experiment significantly different than revenue from customers not in the experiment? What about the BRAVO experiment? Explain the test that you used and include any database queries you would have used to generate the inputs required for the test.")

--------------------------------------------------
Google is always running experiments to try to optimize our products. The CustomerExperiments table indicates which customer IDs are in the ALPHA experiment and which are in the BRAVO experiment. (Some customer IDs are enrolled in both.)
 When comparing total revenue from customer IDs in the ALPHA experiment to total revenue from customer IDs not in the experiment, which cohort has higher revenue?
 Is revenue from customers enrolled in the ALPHA experiment significantly different than revenue from customers not in the experiment? What about the BRAVO experiment? Explain the test that you used and include any database queries you would have used to generate the inputs required for the test.

In [13]:
print("Cohort with with higher")
sql_problem_4 = ("Select CASE WHEN CE.experiment_id = 'ALPHA' then 'ALPHA' else 'NOT_ALPHA' end as experiment_id , sum(printf('%.3f',CR.revenue)) as revenue "
                     "FROM CustomerRevenue CR "
                     "LEFT JOIN CustomerExperiment CE on CR.customer_id = CE.customer_id "
                     "GROUP BY 1;").format(1, 2)
print(sql_problem_4)
pd.read_sql_query(sql_problem_4,conn)

Cohort with with higher
Select CASE WHEN CE.experiment_id = 'ALPHA' then 'ALPHA' else 'NOT_ALPHA' end as experiment_id , sum(printf('%.3f',CR.revenue)) as revenue FROM CustomerRevenue CR LEFT JOIN CustomerExperiment CE on CR.customer_id = CE.customer_id GROUP BY 1;

  experiment_id      revenue
0         ALPHA  1191797.061
1     NOT_ALPHA  1627826.360

In [23]:
print("Breakdown of metrics between ALPHA and Bravo")
sql_problem_4 = ("SELECT QUARTILE, "
                     "MIN(CASE WHEN experiment_id = 'ALPHA' then revenue else null end) as quartile_customer_rev_ALPHA, "
                     "MIN(CASE WHEN experiment_id = 'BRAVO' then revenue else null end) as quartile_customer_rev_BRAVO, "
                     "MIN(CASE WHEN experiment_id is null then revenue else null end) as quartile_customer_rev_NONE, "                 
                     "AVG(CASE WHEN experiment_id = 'ALPHA' then revenue else null end) as average_customer_rev_ALPHA, "
                     "AVG(CASE WHEN experiment_id = 'BRAVO' then revenue else null end) as average_customer_rev_BRAVO, "
                     "AVG(CASE WHEN experiment_id is null then revenue else null end) as average_customer_rev_NONE, "                 
                     "SUM(CASE WHEN experiment_id = 'ALPHA' then revenue else null end) as total_rev_ALPHA, "
                     "SUM(CASE WHEN experiment_id = 'BRAVO' then revenue else null end) as total_rev_BRAVO, "
                     "SUM(CASE WHEN experiment_id is null then revenue else null end) as total_rev_NONE, "                 
                     "COUNT(CASE WHEN experiment_id = 'ALPHA' then customer_id else null end) as participants_ALPHA, "
                     "COUNT(CASE WHEN experiment_id = 'BRAVO' then customer_id else null end) as participants_BRAVO, "
                     "COUNT(CASE WHEN experiment_id is null then customer_id else null end) as participants_NONE "                 
                     "FROM(SELECT experiment_id, customer_id, revenue, rev_rank, "
                      "CASE WHEN rev_rank >=0 AND rev_rank<.25 then '1st Quartile'"
                           "WHEN rev_rank >=.25 AND rev_rank<.5 then '2nd Quartile' "
                           "WHEN rev_rank >=.5 AND rev_rank<.75 then '3rd Quartile' "
                           "WHEN rev_rank >=.75 AND rev_rank<=1 then '4th Quartile' "
                           "END as Quartile "
                          "FROM(SELECT experiment_id, customer_id, revenue, percent_rank() Over(partition by experiment_id ORDER BY revenue asc) as rev_rank "
                            "FROM(Select CE.experiment_id , coalesce(CE.customer_id, CR.customer_id) as customer_id, "
                                 "sum(printf('%.3f',CR.revenue)) as revenue "
                             "FROM CustomerRevenue CR "
                             "LEFT JOIN CustomerExperiment CE on CE.customer_id = CR.customer_id "
                             "GROUP BY 1,2) "
                         "GROUP BY 1,2,3) "                 
                     "GROUP BY 1,2,3,4,5 ORDER BY 1,4,5,2) "
                 "Group by 1;").format(1, 2)
print(sql_problem_4)
pd.read_sql_query(sql_problem_4,conn)

Breakdown of metrics between ALPHA and Bravo
SELECT QUARTILE, MIN(CASE WHEN experiment_id = 'ALPHA' then revenue else null end) as quartile_customer_rev_ALPHA, MIN(CASE WHEN experiment_id = 'BRAVO' then revenue else null end) as quartile_customer_rev_BRAVO, MIN(CASE WHEN experiment_id is null then revenue else null end) as quartile_customer_rev_NONE, AVG(CASE WHEN experiment_id = 'ALPHA' then revenue else null end) as average_customer_rev_ALPHA, AVG(CASE WHEN experiment_id = 'BRAVO' then revenue else null end) as average_customer_rev_BRAVO, AVG(CASE WHEN experiment_id is null then revenue else null end) as average_customer_rev_NONE, SUM(CASE WHEN experiment_id = 'ALPHA' then revenue else null end) as total_rev_ALPHA, SUM(CASE WHEN experiment_id = 'BRAVO' then revenue else null end) as total_rev_BRAVO, SUM(CASE WHEN experiment_id is null then revenue else null end) as total_rev_NONE, COUNT(CASE WHEN experiment_id = 'ALPHA' then customer_id else null end) as participants_ALPHA, COUNT(CASE WHEN experiment_id = 'BRAVO' then customer_id else null end) as participants_BRAVO, COUNT(CASE WHEN experiment_id is null then customer_id else null end) as participants_NONE FROM(SELECT experiment_id, customer_id, revenue, rev_rank, CASE WHEN rev_rank >=0 AND rev_rank<.25 then '1st Quartile'WHEN rev_rank >=.25 AND rev_rank<.5 then '2nd Quartile' WHEN rev_rank >=.5 AND rev_rank<.75 then '3rd Quartile' WHEN rev_rank >=.75 AND rev_rank<=1 then '4th Quartile' END as Quartile FROM(SELECT experiment_id, customer_id, revenue, percent_rank() Over(partition by experiment_id ORDER BY revenue asc) as rev_rank FROM(Select CE.experiment_id , coalesce(CE.customer_id, CR.customer_id) as customer_id, sum(printf('%.3f',CR.revenue)) as revenue FROM CustomerRevenue CR LEFT JOIN CustomerExperiment CE on CE.customer_id = CR.customer_id GROUP BY 1,2) GROUP BY 1,2,3) GROUP BY 1,2,3,4,5 ORDER BY 1,4,5,2) Group by 1;

,Quartile,quartile_customer_rev_ALPHA,quartile_customer_rev_BRAVO,quartile_customer_rev_NONE,average_customer_rev_ALPHA,average_customer_rev_BRAVO,average_customer_rev_NONE,total_rev_ALPHA,total_rev_BRAVO,total_rev_NONE,participants_ALPHA,participants_BRAVO,participants_NONE
0,1st Quartile,100.358,3394.886,103.776,201.973092,3884.283959,166.832135,26458.475,190329.914,16015.885,131,49,96
1,2nd Quartile,355.050,4426.047,250.632,641.990308,5034.161347,388.294177,83458.740,246673.906,37276.241,130,49,96
2,3rd Quartile,1038.897,5699.767,567.263,2030.832200,6381.875878,1007.461760,264008.186,312711.918,96716.329,130,49,96
3,4th Quartile,3450.168,7023.366,1478.211,6243.295115,8410.145400,3204.113510,817871.660,420507.270,307594.897,131,50,96

In [21]:
print("Breakdown of metrics between ALPHA and Bravo")
sql_problem_4 = ("Select coalesce(CE.customer_id, CR.customer_id) as customer_id, CE.experiment_id ,  "
                             "sum(printf('%.3f',CR.revenue)) as revenue "
                             "FROM CustomerRevenue CR "
                             "LEFT JOIN CustomerExperiment CE on CE.customer_id = CR.customer_id "
                             "GROUP BY 1,2").format(1, 2)
print(sql_problem_4)
pd.read_sql_query(sql_problem_4,conn)

Breakdown of metrics between ALPHA and Bravo
Select coalesce(CE.customer_id, CR.customer_id) as customer_id, CE.experiment_id ,  sum(printf('%.3f',CR.revenue)) as revenue FROM CustomerRevenue CR LEFT JOIN CustomerExperiment CE on CE.customer_id = CR.customer_id GROUP BY 1,2

      customer_id experiment_id   revenue
0             104          None   142.839
1             327          None   417.889
2             430         ALPHA  1290.285
3             538          None   267.070
4             585         ALPHA   349.064
5             775         ALPHA   501.019
6             823         ALPHA   108.366
7             961          None   256.016
8             997         ALPHA   253.604
9            1102         ALPHA   764.636
10           1115         BRAVO  5773.934
11           1255         ALPHA  9793.100
12           1393         ALPHA  2445.488
13           1557         ALPHA   734.456
14           1690         ALPHA  2986.432
15           1812         ALPHA   864.672
16           1897         ALPHA   529.555
17           1915         ALPHA  5785.921
18           1915         BRAVO  5785.921
19           2029         BRAVO  5109.524
20           2216         ALPHA   791.972
21           2374          None   345.098
22           2412          None   929.904
23           2433         ALPHA  4036.460
24           2433         BRAVO  4036.460
25           2678          None   275.724
26           2882          None   196.557
27           2980         BRAVO  4672.832
28           3006         BRAVO  4943.859
29           3254          None   341.017
...           ...           ...       ...
1073       120323         ALPHA  3051.200
1074       120476          None  1599.252
1075       120680          None   414.939
1076       120713         ALPHA   194.160
1077       120878         ALPHA  1068.116
1078       120899         ALPHA   164.547
1079       120907         ALPHA   307.614
1080       120954         ALPHA  1039.560
1081       121166          None   953.277
1082       121191          None   142.502
1083       121409          None   439.029
1084       121646          None   176.058
1085       121865          None  1405.755
1086       121940          None   273.038
1087       122012          None   501.756
1088       122088         BRAVO  9250.851
1089       122245         BRAVO  3641.437
1090       122290         ALPHA  4084.259
1091       122290         BRAVO  4084.259
1092       122299         ALPHA  5201.820
1093       122299         BRAVO  5201.820
1094       122491         ALPHA   672.771
1095       122631          None  1982.430
1096       122723          None   766.552
1097       122757         ALPHA   479.963
1098       122809         ALPHA  7277.101
1099       122809         BRAVO  7277.101
1100       122875         ALPHA   281.973
1101       122973         ALPHA   220.934
1102       123067          None  1438.237

[1103 rows x 3 columns]